### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.bastion.azurerm_bastion_host.this has been deleted
  - resource "azurerm_bastion_host" "this" {
      - copy_paste_enabled     = true -> null
      - dns_name               = "bst-79fa5406-cf83-483c-81f9-909e93075862.bastion.azure.com" -> null
      - file_copy_enabled      = false -> null
      - id                     = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-bastion-dev-rg/providers/Microsoft.Network/bastionHosts/rsi-bast" -> null
      - ip_connect_enabled     = false -> null
      - location               = "uksouth" -> null
      - name                   = "rsi-bast" -> null
      - resource_group_name    = "rsi-bastion-dev-rg" -> null
      - scale_units            = 2 -> null
      - shareable_link_enabled = false -> null
      - sku                    = "Basic" -> null
      - tags                   = {
          - "Component"   = "Access"
          - "Region"      = "uk south"
          - "Terraform"   = "true"
          - "environment" = "dev"
        } -> null
      - tunneling_enabled      = false -> null

      - ip_configuration {
          - name                 = "bastion_ip_config" -> null
          - public_ip_address_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-bastion-dev-rg/providers/Microsoft.Network/publicIPAddresses/rsi-bastion-pip" -> null
          - subnet_id            = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/AzureBastionSubnet" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine_scale_set.rsi-frontend-vmss will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "rsi-frontend-vmss" {
        id                                                = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Compute/virtualMachineScaleSets/rsi-vmss-fe"
        name                                              = "rsi-vmss-fe"
        tags                                              = {}
        # (26 unchanged attributes hidden)

      ~ network_interface {
            name                          = "rsi-fe-nic"
            # (4 unchanged attributes hidden)

          ~ ip_configuration {
              ~ load_balancer_backend_address_pool_ids       = [
                  - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/backendAddressPools/BackEndAddressPool",
                ] -> (known after apply)
                name                                         = "internal"
                # (6 unchanged attributes hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.bastion.azurerm_bastion_host.this will be created
  + resource "azurerm_bastion_host" "this" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "uksouth"
      + name                   = "rsi-bast"
      + resource_group_name    = "rsi-bastion-dev-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tags                   = {
          + "Component"   = "Access"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "bastion_ip_config"
          + public_ip_address_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-bastion-dev-rg/providers/Microsoft.Network/publicIPAddresses/rsi-bastion-pip"
          + subnet_id            = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/AzureBastionSubnet"
        }
    }

  # module.fe-loadbalancer.azurerm_lb.azlb must be replaced
-/+ resource "azurerm_lb" "azlb" {
      ~ id                   = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb" -> (known after apply)
      ~ name                 = "fe-lb" -> "rsi-fe-lb" # forces replacement
      + private_ip_address   = (known after apply)
      ~ private_ip_addresses = [] -> (known after apply)
        tags                 = {
            "Component"   = "Frontend"
            "Region"      = "uk south"
            "Terraform"   = "true"
            "environment" = "dev"
        }
        # (4 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/frontendIPConfigurations/myPublicIP" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/loadBalancingRules/http",
            ] -> (known after apply)
            name                                               = "myPublicIP"
          ~ outbound_rules                                     = [] -> (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_version                         = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
          - zones                                              = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.fe-loadbalancer.azurerm_lb_backend_address_pool.azlb must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "azlb" {
      ~ backend_ip_configurations = [
          - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Compute/virtualMachineScaleSets/rsi-vmss-fe/virtualMachines/0/networkInterfaces/rsi-fe-nic/ipConfigurations/internal",
        ] -> (known after apply)
      ~ id                        = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/backendAddressPools/BackEndAddressPool" -> (known after apply)
      ~ inbound_nat_rules         = [] -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/loadBalancingRules/http",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb" # forces replacement -> (known after apply) # forces replacement
        name                      = "BackEndAddressPool"
      ~ outbound_rules            = [] -> (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb_probe.azlb[0] must be replaced
-/+ resource "azurerm_lb_probe" "azlb" {
      ~ id                  = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/probes/http" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/loadBalancingRules/http",
        ] -> (known after apply)
      ~ loadbalancer_id     = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb" # forces replacement -> (known after apply) # forces replacement
        name                = "http"
        # (6 unchanged attributes hidden)
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[0] must be replaced
-/+ resource "azurerm_lb_rule" "azlb" {
      ~ backend_address_pool_ids       = [
          - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/backendAddressPools/BackEndAddressPool",
        ] -> (known after apply)
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/frontendIPConfigurations/myPublicIP" -> (known after apply)
      ~ id                             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/loadBalancingRules/http" -> (known after apply)
      ~ load_distribution              = "Default" -> (known after apply)
      ~ loadbalancer_id                = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb" # forces replacement -> (known after apply) # forces replacement
        name                           = "http"
      ~ probe_id                       = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/probes/http" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  - fe-subnets = [
      - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/AzureBastionSubnet",
      - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/frontend",
    ] -> null

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*